# ************************************************************
# Sequel Ace SQL dump
# 版本号： 20035
#
# https://sequel-ace.com/
# https://github.com/Sequel-Ace/Sequel-Ace
#
# 主机: 127.0.0.1 (MySQL 8.0.27)
# 数据库: testsystem
# 生成时间: 2022-09-15 07:41:53 +0000
# ************************************************************


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
SET NAMES utf8mb4;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE='NO_AUTO_VALUE_ON_ZERO', SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


# 转储表 course
# ------------------------------------------------------------

DROP TABLE IF EXISTS `course`;

CREATE TABLE `course` (
  `id` int NOT NULL AUTO_INCREMENT,
  `courseid` bigint NOT NULL,
  `coursename` varchar(20) NOT NULL,
  `specialty` varchar(20) NOT NULL,
  PRIMARY KEY (`id`,`courseid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

LOCK TABLES `course` WRITE;
/*!40000 ALTER TABLE `course` DISABLE KEYS */;

INSERT INTO `course` (`id`, `courseid`, `coursename`, `specialty`)
VALUES
	(1,10101,'语文','语文'),
	(2,10102,'数学','数学'),
	(3,10103,'物理','物理');

/*!40000 ALTER TABLE `course` ENABLE KEYS */;
UNLOCK TABLES;


# 转储表 objective_question1
# ------------------------------------------------------------

DROP TABLE IF EXISTS `objective_question1`;

CREATE TABLE `objective_question1` (
  `id` int NOT NULL AUTO_INCREMENT,
  `questionid` bigint NOT NULL,
  `questionname` varchar(45) NOT NULL,
  `questioninfo` varchar(90) NOT NULL,
  `questionanswer` varchar(45) NOT NULL,
  `choice_a` varchar(90) DEFAULT NULL,
  `choice_b` varchar(90) DEFAULT NULL,
  `choice_c` varchar(90) DEFAULT NULL,
  `choice_d` varchar(90) DEFAULT NULL,
  PRIMARY KEY (`id`,`questionid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

LOCK TABLES `objective_question1` WRITE;
/*!40000 ALTER TABLE `objective_question1` DISABLE KEYS */;

INSERT INTO `objective_question1` (`id`, `questionid`, `questionname`, `questioninfo`, `questionanswer`, `choice_a`, `choice_b`, `choice_c`, `choice_d`)
VALUES
	(1,1002,'数学','2+2=','D','1','2','3','4'),
	(2,1003,'数学','1+2=','C','1','2','3','4'),
	(3,1004,'数学','13-2=','A','11','8','9','7'),
	(4,1005,'数学','65-53','D','54','45','21','12'),
	(5,1006,'数学','5+9','B','15','14','10','11'),
	(6,1007,'数学','5*8','D','15','20','30','40'),
	(7,1008,'数学','9+4-5','A','8','4','18','11'),
	(8,1009,'数学','9+2','B','9','11','7','10'),
	(9,1010,'数学','5+8','C','10','20','13','17'),
	(10,1011,'语文','“大珠小珠落玉盘”所形容的是什么乐器的弹奏声？','A','琵琶 ','古筝','扬琴','钝角'),
	(11,1012,'语文','《孔雀东南飞》里，刘兰芝\"十三能织素，十四学裁衣，十五弹箜篌，十六诵诗书”，请问，“箜篌”是什么乐器：','A','拨弦乐器','击弦乐器','钝角','钝角'),
	(12,1013,'语文','\"有板有眼\"的\"板\"是我国传统音乐节奏中的','A','强拍 ','弱拍 ','钝角','钝角'),
	(13,1014,'语文','下列文学常识和名著内容的表述，有误的一项是(　　 )','C','《木兰诗》选自宋代郭茂倩编的《乐府诗集》，是南北朝时北方的一首乐府民歌。','《卖油翁》作者是欧阳修，号醉翁，北宋文学家，“唐宋八大家”之一。','《资治通鉴》是北宋司马光编撰的一部纪传体通史，《孙权劝学》就选自其中。','岑参，唐代边塞诗人，长于七言歌行，代表作是《白雪歌送武判官归京》，与高适并称“高岑”。'),
	(14,1015,'语文','下列词语中没有错别字的一项是(　　 )','C','嘹亮　　　 云霄　　　 博览会　　　 翻来复去　　　 各得其所','禁锢　　　 帐蓬　　　 芙蓉鸟　　　 大相径庭　　　 浑为一谈','气概　　　 分歧　　　 主旋律　　　 神采奕奕　　　 不知所措','怂恿　　　 余晖　　　 彩棱镜　　　 随声附合　　　 杞人忧天'),
	(15,1016,'语文','下列词语中没有错别字的一项是(　　 )','A','气概　　　 分歧　　　 主旋律　　　 神采奕奕　　　 不知所措','嘹亮　　　 云霄　　　 博览会　　　 翻来复去　　　 各得其所','禁锢　　　 帐蓬　　　 芙蓉鸟　　　 大相径庭　　　 浑为一谈','怂恿　　　 余晖　　　 彩棱镜　　　 随声附合　　　 杞人忧天'),
	(16,1017,'语文','下列词语中没有错别字的一项是（　　）','C','嘹亮　　 决别　　 不亦乐乎','分歧　　 徘徊　　 翻来复去','倜傥　　 云霄　　 择善而从','烂漫　　 娇媚　　 浑为一谈'),
	(17,1018,'语文','下列句子没有语病的一项是（　　 ）','C','孟非是近年来深受观众喜爱的电视节目主持人，他常常妙语连珠，拥有广泛的支持者，有很高的收视率。','为了提高同学们的语文素养，我校团委积极开展“读经典作品， 建书香校园”。','土地是我的母亲，我的每一寸皮肤，都有着土粒；我的手掌，一接近土地，心就变得平静。','在激烈的市场竞争中，我们所缺乏的，一是勇气不足，二是谋略不当。'),
	(18,1019,'语文','下列句子没有语病的一项是（　　 ）','C','《中国诗词大会》节目致力于弘扬中国传统文化，自开播以来深受观众喜爱的原因是因为其内容新颖和形式多样。','我们只要与自然和谐相处，才能保护好我们赖以生存的家园。','青年人应当把自己的梦想与民族的梦想紧密相连，刻苦学习，在追逐梦想的过程中为中国梦的实现而贡献力量。','在旅游旺季到来之际，我市推广并通过了“美丽乡村游”的休闲旅游政策。'),
	(19,1020,'语文','下列句子没有语病的一项是（　　 ）','C','《中华文明之美》开播以来，深受观众喜爱的原因是其新颖的内容和多样的形式造成的。','2017年12月13日上午，中共中央在南京举行隆重南京大屠杀死难者国家公祭仪式。','“中国特色社会主义进入了新的时代”是习近平同志在党的十九大报告中的新论断。','再过四年，盐城人出脚就可乘上“复兴号”列车，大约1小时左右就能到达大上海。'),
	(20,1021,'物理','甲、乙两辆汽车在平直公路上运动，甲车内一同学看见乙车没有运动，而乙车内一同学看见路旁的木向西移动。如果以地面为参考系，那么（　　 ）','D','甲车不动，乙车向东运动','乙车不动，甲车向东运动','甲车向西运动，乙车向东运动','甲、乙两车以相同的速度一起向东运动'),
	(21,1022,'物理','汽车刹车后做匀减速直线运动，经3s后停止运动，那么，在这连续的3个1s内汽车通过的位移之比为(      )','B','1：3：5  ','5：3：1    ','1：2：3','3：2：1'),
	(22,1023,'物理','汽车刹车后做匀减速直线运动，经3s后停止运动，那么，汽车在这连续的三个1s初的速度之比和这连续的三个1s内汽车通过的位移之比分别为（ ）','A',' v1:v2:v3＝3:2:1','v1:v2:v3＝::','x1:x2:x3＝3:2:1','x1:x2:x3＝5:3:1'),
	(23,1024,'物理','在匀变速直线运动的位移公式和速度公式中除时间t外，共有四个矢量，若取初速度方向为正，那么（        ）','C','匀加速直线运动中a为正值','匀加速直线运动中a为负值','匀减速直线运动中a为负值','匀加速和匀减速直线运动中a均为正值'),
	(24,1025,'物理','物体做匀变速直线运动时，其加速度可用公式计算，关于公式中的物理量，下列说法正确的是　 （　　 ）','B','a是矢量','v是矢量','t是矢量','a的方向由v的方向决定'),
	(25,1026,'物理','下列关于物理学史和物理研究方法的叙述中正确的是　　','C','根据速度定义式，当非常非常小时，就可以表示物体在t时刻的瞬时速度，该定义运用了极值的思想方法','在推导匀变速直线运动位移公式时，把整个运动过程划分成很多小段，每一小段近似看作匀速直线运动，然后把各小段的位移相加，这里采用的是微元法','伽利略借助实验研究和逻辑推理得出了自由落体运动规律','在不需要考虑物体本身的大小和形状时，用质点来代替物体的方法叫假设法'),
	(26,1027,'物理','质量为0.3kg的物体在水平面上做直线运动，水平方向物体只受摩擦力作用时和水平方向受到摩擦力、水平力F两个力共同作用时的速度一时间图像，则下列说法中正确','C','水平力F可能等于0.3N','物体的摩擦力一定等于0.1N','水平力F一定等于0.1N','物体的摩擦力可能等于0.3N'),
	(27,1028,'物理','某质点做直线运动的位移随时间变化的关系是，与的单位分别为和，则质点的初速度与加速度分别为（　　 ）','C','4m/s与2m/s2','.0与4m/s2','4m/s与4m/s2','4m/s与0'),
	(28,1029,'物理','一物体从H高处自由下落，经时间t落地，则当它下落t/2时，离地的高度为（　　 ）','C','H/2','H/4','3H/4','3H/2'),
	(29,1030,'物理','在物理学的发展历程中，下面的哪位科学家首先首先采用了实验检验猜想和假设的科学方法，把实验和逻辑推理和谐地结合起来 (    )','B','亚里士多德','伽利略','牛顿  ','爱因斯坦'),
	(30,1001,'数学','1+1=','B','1','2','3','4');

/*!40000 ALTER TABLE `objective_question1` ENABLE KEYS */;
UNLOCK TABLES;


# 转储表 objective_question2
# ------------------------------------------------------------

DROP TABLE IF EXISTS `objective_question2`;

CREATE TABLE `objective_question2` (
  `id` int NOT NULL AUTO_INCREMENT,
  `questionid` bigint NOT NULL,
  `questionname` varchar(45) NOT NULL,
  `questioninfo` varchar(90) NOT NULL,
  `questionanswer` varchar(20) NOT NULL,
  `choice1` varchar(20) NOT NULL,
  `choice2` varchar(20) NOT NULL,
  PRIMARY KEY (`id`,`questionid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

LOCK TABLES `objective_question2` WRITE;
/*!40000 ALTER TABLE `objective_question2` DISABLE KEYS */;

INSERT INTO `objective_question2` (`id`, `questionid`, `questionname`, `questioninfo`, `questionanswer`, `choice1`, `choice2`)
VALUES
	(1,1001,'语文','模糊(mó)　似乎(sì)　转身(zhuǎn)　分量(fèng)这些多音字的读音没有一个错的。','错','对','错'),
	(2,1002,'语文','“辉”用部首查字法查“光”部，“光辉”的“辉”与“辉煌”的“辉”意思一样。','错','对','错'),
	(3,1003,'语文','焕然一新、守株待兔、卧薪尝胆、胸有成竹”这一组词感情色彩相同，都是褒义词。','错','对','错'),
	(4,1004,'语文','“春天的杭州是一年四季中最美的季节。”与“两个新旧社会，真是鲜明的对比啊!”都犯了语序颠倒的错误。','对','对','错'),
	(5,1005,'语文','“海燕出版社出版的《世界文学名著漫画本》解决了少年朋友在阅读世界文学名著中所遇到的难题。”这句话若缩句，应该是“出版社解决了难题”。','错','对','错'),
	(6,1006,'语文','蔺相如对手下的人说：“秦王我都不怕，我会怕廉将军吗?”改成间接转述应该是，蔺相如对手下的人说：“秦王他都不怕，他更不会怕廉将军。”','错','对','错'),
	(7,1007,'语文','孙慎是我国著名的革命音乐家，镇海人。','错','对','错'),
	(8,1008,'语文','李伟用自己的脚挡住了对方踢来的球。缩句：脚挡住了球。','错','对','错'),
	(9,1009,'语文','“古往今来，人们虽然提到庐山，总是把它和云雾连在一起。”这句话','错','对','错'),
	(10,1010,'语文','在“电视机、洗衣机、发电机、录音机”中，不属于同一类的词语是','对','对','错'),
	(11,1011,'数学','a9÷a3=a3；','错','对','错'),
	(12,1012,'数学','（-b）4÷（-b）2=-b2；','错','对','错'),
	(13,1013,'数学','s11÷s11=0','错','对','错'),
	(14,1014,'数学','（-m）6÷（-m）3=-m3','对','对','错'),
	(15,1015,'数学','x8÷x4÷x2=x2','对','对','错'),
	(16,1016,'数学','n8÷（n4×n2）=n2','对','对','错'),
	(17,1017,'数学','在平面内，过直线外一点有且只有一条直线与已知直线垂直  （    ）','对','对','错'),
	(18,1018,'数学','过直线上一点不存在直线与已知直线垂直.                  （    ）','错','对','错'),
	(19,1019,'数学','过直线外一点A作的垂线，垂线的长度叫做点A到直线的距离.（    ）','错','对','错'),
	(20,1020,'数学','一条线段有无数条垂线.                                   （    ）','对','对','错'),
	(21,1021,'物理','物体温度升高，它的内能一定增加','对','对','错'),
	(22,1022,'物理','物体内能增加，它的温度一定升高','错','对','错'),
	(23,1023,'物理','物体温度变化，它一定吸收或放出热量','错','对','错'),
	(24,1024,'物理','物体吸收或放出热量，它的温度一定变化','错','对','错'),
	(25,1025,'物理','当同种物体的质量相等时，吸收相同的热量，它的比热容与升高的温度成正比','错','对','错'),
	(26,1026,'物理','物体的内能越大，它的温度一定越高。','错','对','错'),
	(27,1027,'物理','物体吸收的热量越多，它温度一定变化越大。','错','对','错'),
	(28,1028,'物理','水在0℃时一定结冰（）','错','对','错'),
	(29,1029,'物理','用质量相等的0℃的冰和0℃的水冷却物体的效果是相同的（）','错','对','错'),
	(30,1030,'物理','液体不放热有时也可以凝固（）','错','对','错');

/*!40000 ALTER TABLE `objective_question2` ENABLE KEYS */;
UNLOCK TABLES;


# 转储表 paper
# ------------------------------------------------------------

DROP TABLE IF EXISTS `paper`;

CREATE TABLE `paper` (
  `id` int NOT NULL AUTO_INCREMENT,
  `paperid` bigint NOT NULL,
  `testlevel` varchar(10) NOT NULL,
  `testcourse` varchar(20) NOT NULL,
  `questionteacher` varchar(20) NOT NULL,
  `question` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci,
  `questiontype` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `questionanswer` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`id`,`paperid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

LOCK TABLES `paper` WRITE;
/*!40000 ALTER TABLE `paper` DISABLE KEYS */;

INSERT INTO `paper` (`id`, `paperid`, `testlevel`, `testcourse`, `questionteacher`, `question`, `questiontype`, `questionanswer`)
VALUES
	(20,1001,'中等','语文','2022071206','1011,1012;1002,1003;1002,1003;','objective_question1,objective_question2,subjective_question',NULL),
	(21,1002,'中等','语文','2022071206','1016,1017;1009,1010;1003,1004;','objective_question1,objective_question2,subjective_question',NULL),
	(43,1005,'简单','数学','2022071206','1007,1008;1012,1013;1018,1019,1020;','objective_question1,objective_question2,subjective_question',NULL),
	(44,1020,'中等','语文','2022071206','1011,1012;1001,1002;1001,1002;','objective_question1,objective_question2,subjective_question',NULL),
	(45,1018,'简单','数学','2022071206','1009,1010;1019,1020;1014,1015,1016;','objective_question1,objective_question2,subjective_question',NULL),
	(46,1030,'中等','语文','2022071206','1011,1012;1001,1002;1001,1002;','objective_question1,objective_question2,subjective_question',NULL),
	(47,1031,'简单','数学','2022071206','1003,1004;1016,1017;1012,1013,1014;','objective_question1,objective_question2,subjective_question',NULL),
	(48,1032,'简单','Math','0','1009;1017,1018;1014,1015;','objective_question1,objective_question2,subjective_question',NULL),
	(49,1033,'简单','语文','0','1018,1019,1020;1007,1008,1009;1003,1004,1005,1006;','objective_question1,objective_question2,subjective_question',NULL),
	(50,1034,'简单','语文','0','1015;1004,1005;1001,1002;','objective_question1,objective_question2,subjective_question',NULL),
	(51,1035,'','数学','0','1007,1008;1016,1017,1018;1015,1016,1017;','objective_question1,objective_question2,subjective_question',NULL),
	(52,1234,'high','数学','0','1010;1013;1017;','objective_question1,objective_question2,subjective_question',NULL),
	(53,1235,'','物理','0','1021,1022;1024,1025,1026;1022,1023,1024;','objective_question1,objective_question2,subjective_question',NULL),
	(54,1236,'','数学','0','1004;1017,1018;1017,1018;','objective_question1,objective_question2,subjective_question',NULL),
	(55,1237,'中等','数学','0','1002;1013,1014;1017,1018;','objective_question1,objective_question2,subjective_question',NULL),
	(56,1238,'','数学','0','1011,1012,1013;',',objective_question2',NULL),
	(57,1239,'','数学','0','1011,1012,1013;',',objective_question2',NULL),
	(58,1240,'','数学','0','1003,1004,1005;1014,1015,1016;1015,1016,1017,1018;','objective_question1,objective_question2,subjective_question',NULL),
	(60,1241,'','物理','0','1021,1022;',',subjective_question',NULL),
	(61,1042,'','数学','0','1014,1015;',',objective_question2',NULL),
	(62,1043,'','物理','0','1021,1022;',',subjective_question',NULL),
	(63,1044,'','物理','0','1021,1022;',',subjective_question',NULL),
	(64,1045,'','语文','0','1001,1002,1003;',',objective_question2',NULL),
	(65,1046,'','数学','0','1011,1012;',',objective_question2',NULL),
	(66,1047,'','数学','0','1011,1012,1015,1016;',',objective_question2',NULL),
	(67,1048,'','物理','0','1029;1022;1023,1024;','objective_question1,objective_question2,subjective_question',NULL),
	(68,1049,'','数学','0','1002;1012;1013,1014;','objective_question1,objective_question2,subjective_question',NULL),
	(69,1050,'','语文','0','1011,1012,1013,1014;','objective_question1',NULL),
	(70,1051,'','数学','0','1003;1016,1017;1015,1016;','objective_question1,objective_question2,subjective_question',NULL),
	(71,1052,'','物理','0','1028;1029,1030;1021,1022;','objective_question1,objective_question2,subjective_question',NULL),
	(72,1053,'','数学','0','1009;1017;1014;','objective_question1,objective_question2,subjective_question',NULL),
	(73,1054,'','语文','0','1011;1004;1009,1010;','objective_question1,objective_question2,subjective_question',NULL),
	(74,1055,'','数学','0','1002,1003,1004,1005;','objective_question1',NULL),
	(75,1056,'','语文','0','1014;1008;1006;','objective_question1,objective_question2,subjective_question',NULL),
	(76,1057,'','语文','0','1013;1001;1010;','objective_question1,objective_question2,subjective_question',NULL),
	(77,1058,'','数学','0','1002;1017;1018,1019;','objective_question1,objective_question2,subjective_question',NULL),
	(78,1059,'','语文','0','1012;1007;1003;','objective_question1,objective_question2,subjective_question',NULL),
	(79,1060,'','数学','0','1011,1012,1013,1014,1015,1016;',',subjective_question',NULL),
	(80,1061,'','数学','0','1008,1009,1010;1018,1019,1020;1012,1013,1014,1015;','objective_question1,objective_question2,subjective_question',NULL),
	(81,1062,'','数学','0','1011,1012,1013,1014,1015;',',objective_question2',NULL),
	(82,1063,'','语文','0','1001;',',subjective_question',NULL),
	(83,1064,'','数学','0','1002,1003,1004,1005;','objective_question1',NULL),
	(84,1065,'','物理','0','1021,1022,1023,1024;',',subjective_question',NULL),
	(85,1066,'','数学','0','1003,1004;1014,1015;1012,1013;','objective_question1,objective_question2,subjective_question',NULL),
	(86,1067,'','数学','0','1003;1012;1011,1012;','objective_question1,objective_question2,subjective_question',NULL),
	(87,1068,'','物理','0','1021,1022,1023,1024;','objective_question1',NULL),
	(88,1069,'','语文','0','1001,1002,1003,1004;',',subjective_question',NULL),
	(89,1070,'','物理','0','1021,1022,1023,1024;','objective_question1',NULL),
	(90,1071,'','数学','0','1005;1012,1013;1017,1018;','objective_question1,objective_question2,subjective_question',NULL),
	(91,1072,'','数学','0','1003,1004;1014,1015;1013,1014;','objective_question1,objective_question2,subjective_question',NULL),
	(92,1073,'','数学','0','1008,1009;1013,1014;1014,1015;','objective_question1,objective_question2,subjective_question',NULL),
	(93,1074,'','数学','0','1002,1003,1004,1005;','objective_question1',NULL),
	(94,1075,'','语文','0','1018,1019;1003,1004;1001,1002;','objective_question1,objective_question2,subjective_question',NULL),
	(95,1076,'','数学','0','1005,1006;1014,1015;1017,1018;','objective_question1,objective_question2,subjective_question',NULL),
	(96,1077,'','数学','0','1002,1003,1004,1005,1006,1007,1008,1009,1010,1001;','objective_question1',NULL),
	(97,1078,'','语文','0','1016,1017;1008,1009,1010;1001,1002,1003;','objective_question1,objective_question2,subjective_question',NULL),
	(98,1079,'','语文','0','1018,1019,1020;1007,1008,1009;1003,1004,1005,1006;','objective_question1,objective_question2,subjective_question',NULL),
	(99,1080,'','数学','0','1002,1003,1004,1005;','objective_question1',NULL),
	(100,1081,'','语文','0','1015,1016;1006,1007;1008,1009,1010;','objective_question1,objective_question2,subjective_question',NULL),
	(101,1082,'','物理','0','1021,1022,1023,1024,1025,1026;','objective_question1',NULL),
	(102,1083,'','数学','0','1008,1009;1018,1019;1011,1012;','objective_question1,objective_question2,subjective_question',NULL),
	(103,1084,'','物理','0','1026;1028;1029,1030;','objective_question1,objective_question2,subjective_question',NULL),
	(104,1085,'','语文','0','1012;1001;1001;','objective_question1,objective_question2,subjective_question',NULL),
	(105,1086,'','数学','0','1006,1007,1008;1013,1014,1015;1015,1016,1017,1018;','objective_question1,objective_question2,subjective_question',NULL),
	(106,1087,'','语文','0','1014,1015;1001,1002;1008,1009;','objective_question1,objective_question2,subjective_question',NULL),
	(107,1088,'','物理','0','1025;1021,1022;1026,1027;','objective_question1,objective_question2,subjective_question',NULL),
	(108,1089,'','语文','0','1016,1017;1008,1009;1001,1002;','objective_question1,objective_question2,subjective_question',NULL),
	(109,1090,'','语文','0','1016;1007,1008;1005,1006;','objective_question1,objective_question2,subjective_question',NULL),
	(110,1091,'','语文','0','1013,1014;1007,1008;1003,1004;','objective_question1,objective_question2,subjective_question',NULL),
	(111,1092,'','语文','0','1016;1003;1010;','objective_question1,objective_question2,subjective_question',NULL),
	(112,1093,'','语文','0','1012,1013;1005,1006;1005,1006,1007;','objective_question1,objective_question2,subjective_question',NULL),
	(113,1094,'','数学','0','1002,1003;1012,1013;1019,1020;','objective_question1,objective_question2,subjective_question',NULL),
	(114,1095,'','数学','0','1008;1018;1011;','objective_question1,objective_question2,subjective_question',NULL),
	(115,1096,'','数学','0','1011,1012,1013,1014,1015,1016,1017,1018,1019,1020;',',objective_question2',NULL),
	(116,1097,'','语文','0','1013;1004,1005;1004,1005;','objective_question1,objective_question2,subjective_question',NULL),
	(117,1242,'','语文','0','1015,1016;1002,1003;1009,1010;','objective_question1,objective_question2,subjective_question',NULL),
	(118,1243,'','语文','0','1011,1012,1013,1014,1015,1016,1017,1018,1019,1020;','objective_question1',NULL),
	(119,1244,'','数学','0','1009,1010,1001;1013,1014,1015;1017,1018,1019,1020;','objective_question1,objective_question2,subjective_question',NULL),
	(120,1245,'','语文','0','1001,1002,1003,1004,1005,1006,1007,1008,1009,1010;',',subjective_question',NULL),
	(121,1246,'','数学','0','1005,1006,1007;1014,1015,1016;1013,1014,1015;','objective_question1,objective_question2,subjective_question',NULL),
	(122,1247,'','数学','0','1007,1008,1009;1017,1018,1019;1014,1015,1016,1017;','objective_question1,objective_question2,subjective_question',NULL),
	(123,1248,'','语文','0','1012,1013,1014,1015;','objective_question1',NULL),
	(124,1249,'','数学','0','1010,1001;1018,1019;1011,1012,1013;','objective_question1,objective_question2,subjective_question',NULL),
	(125,1250,'','数学','0','1011,1012,1013;',',objective_question2',NULL),
	(126,1251,'','语文','0','1001,1002,1003,1004;',',objective_question2',NULL),
	(127,1252,'','语文','0','1001,1002,1003,1004;',',objective_question2',NULL),
	(128,1253,'','数学','0','1010,1001;1012,1013,1014;1014,1015,1016;','objective_question1,objective_question2,subjective_question',NULL),
	(129,1254,'','语文','0','1019;1001;1008,1009;','objective_question1,objective_question2,subjective_question',NULL);

/*!40000 ALTER TABLE `paper` ENABLE KEYS */;
UNLOCK TABLES;


# 转储表 subjective_question
# ------------------------------------------------------------

DROP TABLE IF EXISTS `subjective_question`;

CREATE TABLE `subjective_question` (
  `id` int NOT NULL AUTO_INCREMENT,
  `questionid` bigint NOT NULL,
  `questionname` varchar(45) NOT NULL,
  `questioninfo` varchar(100) NOT NULL,
  `questionanswer` varchar(150) NOT NULL,
  PRIMARY KEY (`id`,`questionid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

LOCK TABLES `subjective_question` WRITE;
/*!40000 ALTER TABLE `subjective_question` DISABLE KEYS */;

INSERT INTO `subjective_question` (`id`, `questionid`, `questionname`, `questioninfo`, `questionanswer`)
VALUES
	(1,1001,'语文','huò (  )达乐观','豁'),
	(2,1002,'语文','bì（     ）益','裨'),
	(3,1003,'语文','驰chěng（     ）','骋'),
	(4,1004,'语文','xī（     ）来攘往','熙'),
	(5,1005,'语文','沈括是北宋时期著名的科学家、政治家，著有________。','《梦溪笔谈》'),
	(6,1006,'语文','《皇帝的新装》作者是丹麦作家________，他一生创作了160余篇童话，代表作有《海的女儿》、《卖火柴的小女孩》等。','安徒生'),
	(7,1007,'语文','《繁星》一文的作者是　　　　　　　 ，他是我国现代著名作家，著有长篇小说《家》《春》《秋》（合称“激流三部曲”）等著名作品。','巴金'),
	(8,1008,'语文','《水调歌头》，作者　　　　　　 ， 宋 代文学家，唐宋八大家之一。','苏轼'),
	(9,1009,'语文','《社戏》一文的体裁是　　　　　　　　 。','小说'),
	(10,1010,'语文','《汤姆·索亚历险记》的作者　　　　　 ','马克·吐温'),
	(11,1011,'数学','甲、乙两人各走一段路，他们的速度比是3:4，路程比是7:3，那么他们所需的时间比是（ ）','28:9'),
	(12,1012,'数学','用四舍五入法将0.5395精确到千分位是（ ）。','0.540'),
	(13,1013,'数学','一个长方体棱长和为120厘米，且长宽高的比为2：2：1，那么这个长方体最多有（ ）个面大小相等。','4'),
	(14,1014,'数学','三数之和是l20，甲数是乙数的2倍，丙数比乙数多20，丙数是（ ','45'),
	(15,1015,'数学','a的倒数大于b的倒数，那么a（ ）b。（填>,<或=）','<'),
	(16,1016,'数学','一辆快车和一辆慢车同时分别从甲、乙两地相对开出，经l2小时后相遇，快车又行驶了8小时到达乙地，那么相遇后慢车还要行驶（ ）小时才能到达甲地。','18'),
	(17,1017,'数学','一个长方形长宽之比是4：3，面积是432平方厘米，它的周长是（ ）厘米。','84'),
	(18,1018,'数学','修一段长80米的公路，修了的是剩下的3/5，修了（ ）米。','30'),
	(19,1019,'数学','紧靠一道围墙边，用18米长的竹篱笆围出一块长方形（边长为整数）的菜地，这块菜地的面积最大是（ ）平方米。 (本题分数：2分)','40'),
	(20,1020,'数学','甲数的2/3与乙数的和是60，甲数的4/9正好等于乙数。甲、乙两数的和是（ ）。 (本题分数：2分)','78'),
	(21,1021,'物理','高山滑雪是冬奥会的重要竞赛项目之一，如图所示是滑雪运动员从山顶加速下滑训练的情境。在下滑过程中运动员的动能_____（均选填“减小”、“增大”或“不变”）。','增大'),
	(22,1022,'物理','若将A、B串联接入某电源两端，则闭合开关后，它们两端的电压U1、U2之比是_____：若将A、B并联接入电源两端，闭合开关后，测得干路电流为0.6A，则电源电压是2V。','1:2'),
	(23,1023,'物理','如图所示，水壶的壶嘴和壶身构成一个简单的________。','连通器'),
	(24,1024,'物理','爆炒肉片时，厨师们往往预先将肉片拌入适量的淀粉，在放入锅中炒，这样肉片里的水分难以______（填写物态变化名称），能保持肉片的鲜嫩味美，厨房内的肉香味能传的很远','蒸发'),
	(25,1025,'物理','如图所示，在“探究光的反射规律”实验中，小明将硬纸板竖直地立在平面镜上，盘硬纸板上的直线ON垂直于镜面，右侧纸板可绕ON向后转动，如图甲所示，若增大入射角，则反射角________','增大'),
	(26,1026,'物理','港珠澳大桥海底隧道长6.7km，小明乘车通过海底隧道，在进、出隧道口时花了5分钟均速度为_____km/h','80.4'),
	(27,1027,'物理','电源电压为3V．闭合开关后，小灯泡L1、L2都不亮．小鹭同学用电压表检测后，得出L1断路的结论．其测量结果应该是：Uab=____V，Ubc=0V，Uac=3V．','3'),
	(28,1028,'物理','如图所示为一种新型的“风光互补”景观照明灯，白天工作时，太阳能电池板将______.（填能的转化）','太阳能转化为电能'),
	(29,1029,'物理','某电热暖手宝的主要参数。选用水作为吸热或放热物质，是因为水的_____较大。','比热容'),
	(30,1030,'物理','高速气流通过吸管上方时，流速越大的地方压强越小，______会把液体压入气压小的地方从而被气流吹放。','大气压');

/*!40000 ALTER TABLE `subjective_question` ENABLE KEYS */;
UNLOCK TABLES;


# 转储表 test
# ------------------------------------------------------------

DROP TABLE IF EXISTS `test`;

CREATE TABLE `test` (
  `id` int NOT NULL AUTO_INCREMENT,
  `paperid` bigint NOT NULL,
  `course` varchar(45) NOT NULL,
  `madedate` datetime NOT NULL,
  `limitedtime` int NOT NULL,
  `teacherid` bigint NOT NULL,
  `testid` bigint NOT NULL,
  `mader` bigint NOT NULL,
  PRIMARY KEY (`id`,`paperid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

LOCK TABLES `test` WRITE;
/*!40000 ALTER TABLE `test` DISABLE KEYS */;

INSERT INTO `test` (`id`, `paperid`, `course`, `madedate`, `limitedtime`, `teacherid`, `testid`, `mader`)
VALUES
	(1,1,'语文','2022-07-12 11:01:03',60,1,1,1),
	(2,2,'数学','2022-07-13 11:01:03',120,1,2,1),
	(3,3,'高等数学','2022-07-13 11:01:03',120,1,3,1),
	(48,1005,'数学','2022-07-12 11:00:00',60,2022071206,1005,2022071206),
	(49,1020,'语文','2022-07-12 11:01:03',60,2022071206,1001,2022071206),
	(50,1018,'数学','2022-07-12 11:00:00',60,2022071206,1005,2022071206),
	(51,1030,'语文','2022-07-12 11:01:03',60,2022071206,1001,2022071206),
	(52,1031,'数学','2022-07-12 11:00:00',60,2022071206,1005,2022071206),
	(53,1032,'Math','2022-07-18 14:00:00',60,0,1032,0),
	(54,1033,'语文','2022-07-18 14:00:00',60,0,1033,0),
	(55,1034,'语文','2022-07-19 10:06:04',60,0,1034,0),
	(56,1034,'语文','2022-07-19 10:06:04',60,0,1034,0),
	(57,1034,'语文','2022-07-19 10:06:04',60,0,1034,0),
	(58,1035,'数学','2022-07-19 12:46:51',60,0,1035,0),
	(59,1234,'数学','2022-08-30 13:17:17',60,0,1234,0),
	(60,1235,'物理','2022-08-09 12:17:50',60,0,1235,0),
	(61,1236,'数学','2022-08-09 12:42:44',60,0,1236,0),
	(62,1237,'数学','2022-08-09 13:53:09',60,0,1237,0),
	(63,1238,'数学','2022-08-09 13:54:09',60,0,1238,0),
	(64,1239,'数学','2022-08-09 14:24:01',60,0,1239,0),
	(65,1240,'数学','2022-08-09 14:33:45',60,0,1240,0),
	(66,1240,'物理','2022-08-09 14:24:01',60,0,1240,0),
	(67,1241,'物理','2022-08-09 14:24:01',60,0,1241,0),
	(68,1241,'物理','2022-08-09 14:37:12',60,0,1241,0),
	(69,1042,'数学','2022-08-09 15:00:00',60,0,1042,0),
	(70,1043,'物理','2022-08-09 15:01:33',30,0,1043,0),
	(71,1044,'物理','2022-08-09 15:01:33',30,0,1044,0),
	(72,1045,'语文','2022-08-09 15:26:19',30,0,1045,0),
	(73,1046,'数学','2022-08-09 15:32:00',30,0,1046,0),
	(74,1047,'数学','2022-08-09 15:32:00',30,0,1047,0),
	(75,1048,'物理','2022-08-09 15:32:38',30,0,1048,0),
	(76,1049,'数学','2022-08-13 14:48:38',30,0,1049,0),
	(77,1050,'语文','2022-08-13 14:57:27',30,0,1050,0),
	(78,1051,'数学','2022-08-13 15:05:37',30,0,1051,0),
	(79,1052,'物理','2022-08-14 12:40:32',30,0,1052,0),
	(80,1053,'数学','2022-08-14 12:53:46',30,0,1053,0),
	(81,1054,'语文','2022-08-14 12:58:16',30,0,1054,0),
	(82,1055,'数学','2022-08-14 13:58:50',30,0,1055,0),
	(83,1056,'语文','2022-08-14 13:04:48',30,0,1056,0),
	(84,1057,'语文','2022-08-14 13:05:54',30,0,1057,0),
	(85,1058,'数学','2022-08-14 13:06:54',30,0,1058,0),
	(86,1059,'语文','2022-08-14 14:31:04',30,0,1059,0),
	(87,1060,'数学','2022-08-14 14:40:38',30,0,1060,0),
	(88,1061,'数学','2022-08-14 14:41:36',30,0,1061,0),
	(89,1062,'数学','2022-08-14 14:49:19',31,0,1062,0),
	(90,1063,'语文','2022-08-14 14:51:05',30,0,1063,0),
	(91,1064,'数学','2022-08-14 15:02:02',30,0,1064,0),
	(92,1065,'物理','2022-08-14 15:03:19',30,0,1065,0),
	(93,1066,'数学','2022-08-14 15:04:11',30,0,1066,0),
	(94,1067,'数学','2022-08-14 15:05:38',30,0,1067,0),
	(95,1068,'物理','2022-08-14 15:06:12',30,0,1068,0),
	(96,1069,'语文','2022-08-14 15:08:07',30,0,1069,0),
	(97,1070,'物理','2022-08-14 15:09:18',30,0,1070,0),
	(98,1071,'数学','2022-08-14 15:10:26',30,0,1071,0),
	(99,1072,'数学','2022-08-14 15:12:11',30,0,1072,0),
	(100,1073,'数学','2022-08-14 15:15:06',30,0,1073,0),
	(101,1074,'数学','2022-08-14 15:16:16',30,0,1074,0),
	(102,1075,'语文','2022-08-14 15:19:12',30,0,1075,0),
	(103,1076,'数学','2022-08-14 15:20:31',30,0,1076,0),
	(104,1077,'数学','2022-08-14 15:25:48',30,0,1077,0),
	(105,1078,'语文','2022-08-14 16:19:11',30,0,1078,0),
	(106,1079,'语文','2022-08-14 16:24:55',30,0,1079,0),
	(107,1080,'数学','2022-08-14 16:26:57',30,0,1080,0),
	(108,1081,'语文','2022-08-14 16:39:16',30,0,1081,0),
	(109,1082,'物理','2022-08-14 16:40:00',30,0,1082,0),
	(110,1083,'数学','2022-08-16 13:13:23',30,0,1083,0),
	(111,1084,'物理','2022-08-16 13:22:55',30,0,1084,0),
	(112,1085,'语文','2022-08-16 13:28:11',30,0,1085,0),
	(113,1086,'数学','2022-08-16 13:29:57',30,0,1086,0),
	(114,1087,'语文','2022-08-16 13:34:19',30,0,1087,0),
	(115,1088,'物理','2022-08-16 13:42:52',30,0,1088,0),
	(116,1089,'语文','2022-08-16 13:54:53',30,0,1089,0),
	(117,1090,'语文','2022-08-16 14:55:50',30,0,1090,0),
	(118,1091,'语文','2022-08-16 15:14:04',30,0,1091,0),
	(119,1092,'语文','2022-08-16 15:14:49',30,0,1092,0),
	(120,1093,'语文','2022-08-16 15:17:27',30,0,1093,0),
	(121,1094,'数学','2022-08-16 15:22:55',30,0,1094,0),
	(122,1094,'语文','2022-08-16 15:26:08',30,0,1094,0),
	(123,1095,'数学','2022-08-16 15:26:35',30,0,1095,0),
	(124,1094,'语文','2022-08-16 15:28:09',30,0,1094,0),
	(125,1096,'数学','2022-08-16 15:34:42',30,0,1096,0),
	(126,1097,'语文','2022-08-16 15:35:45',30,0,1097,0),
	(127,1242,'语文','2022-08-16 15:56:25',30,0,1242,0),
	(128,1243,'语文','2022-08-16 15:57:21',30,0,1243,0),
	(129,1244,'数学','2022-08-17 15:09:23',30,0,1244,0),
	(130,1245,'语文','2022-08-18 15:13:09',30,0,1245,0),
	(131,1246,'数学','2022-08-17 15:31:12',30,0,1246,0),
	(132,1247,'数学','2022-08-17 15:34:42',30,0,1247,0),
	(133,1248,'语文','2022-08-17 15:35:43',31,0,1248,0),
	(134,1249,'数学','2022-08-25 15:25:46',30,0,1249,0),
	(135,1250,'数学','2022-08-25 15:27:58',30,0,1250,0),
	(136,1252,'语文','2022-08-31 21:14:32',34,0,1252,0),
	(137,1253,'数学','2022-08-31 21:28:45',30,0,1253,0),
	(138,1254,'语文','2022-08-31 21:29:43',30,0,1254,0);

/*!40000 ALTER TABLE `test` ENABLE KEYS */;
UNLOCK TABLES;


# 转储表 user
# ------------------------------------------------------------

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` int NOT NULL AUTO_INCREMENT,
  `userid` bigint NOT NULL,
  `username` varchar(20) NOT NULL,
  `password` varchar(20) NOT NULL,
  `sex` varchar(2) NOT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `specialty` varchar(15) DEFAULT NULL,
  `faculties` varchar(15) DEFAULT NULL,
  `class` varchar(15) DEFAULT NULL,
  `type` int NOT NULL,
  PRIMARY KEY (`id`,`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;

INSERT INTO `user` (`id`, `userid`, `username`, `password`, `sex`, `phone`, `specialty`, `faculties`, `class`, `type`)
VALUES
	(1,2022071201,'小明','123456789','男','1234567890',NULL,NULL,'201',1),
	(2,2022071202,'小红','123456789','女','1234567890',NULL,NULL,'201',1),
	(3,2022071203,'小强','123456789','男','1234567890',NULL,NULL,'201',1),
	(4,2022071204,'王老师','123456789','男','1234567890','语文','语文学院','201',2),
	(5,2022071205,'张老师','123456789','女','1234567890','数学','数学学院','202',2),
	(6,2022071206,'高老师','123456789','男','1234567890','物理','物理学院','203',2),
	(7,101,'admin','123456','男','1234567890',NULL,NULL,NULL,3),
	(8,2022071207,'小李','123456789','男','1234567890',NULL,NULL,'202',1),
	(9,2022071208,'小丽','123456789','女','1234567890',NULL,NULL,'202',1),
	(10,2022071209,'小王','123456789','男','1234567890',NULL,NULL,'202',1),
	(11,2100303310,'cs','123','男','123456','','','302',1);

/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;



/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
